{
  "promoter": [
    "Love the team culture and growth opportunities here!",
    "Best company I've worked for. Great leadership and clear vision.",
    "Excellent work-life balance and the projects are genuinely interesting.",
    "Management is transparent and I feel valued for my contributions.",
    "Amazing colleagues and opportunities to learn new skills every day.",
    "The company truly cares about employee development and wellbeing.",
    "Really enjoy coming to work. The culture is supportive and inclusive.",
    "Feel like I'm making a real impact here. Highly recommend to friends.",
    "Great benefits, interesting work, and a supportive team environment.",
    "Leadership listens to feedback and actually makes changes. Impressed!",
    "Lots of room to grow. My manager has been incredibly supportive.",
    "The mission here is meaningful and I'm proud of our work."
  ],
  "passive": [
    "Good place to work, but compensation could be more competitive.",
    "Generally satisfied, though career paths could be clearer.",
    "Nice people but sometimes communication gaps between teams.",
    "Decent work environment. Some processes could be more efficient.",
    "Benefits are good. Would like to see more professional development.",
    "Stable company with good culture. Could improve on recognition.",
    "Work is fine but sometimes feel disconnected from company direction.",
    "Okay overall. Manager is good but executive decisions feel distant.",
    "Like my team but wish there were more growth opportunities.",
    "Fair workplace. Some room for improvement in tools and resources.",
    "Solid company. Would appreciate more transparency on promotions.",
    "Good culture but workload has been increasing without added support."
  ],
  "detractor": [
    "Feeling burnt out. Workload is unsustainable and unrealistic.",
    "Leadership decisions feel disconnected from day-to-day reality.",
    "Limited growth opportunities in my current role.",
    "Communication from leadership is poor. Often left in the dark.",
    "Work-life balance is suffering. Too many after-hours expectations.",
    "Feel undervalued and underpaid compared to market rates.",
    "Management doesn't listen to feedback from the team.",
    "Too much bureaucracy and not enough action on real problems.",
    "Lack of clear direction makes it hard to prioritize work.",
    "High turnover is affecting morale and increasing workload.",
    "Recognition is inconsistent. Hard work often goes unnoticed.",
    "Need more support and resources to do the job effectively."
  ],
  "declining": [
    "Used to love it here but things have changed. Morale is dropping.",
    "Company culture has shifted. Less collaborative than before.",
    "Increased pressure without corresponding support or recognition.",
    "Starting to question long-term fit. May explore other options.",
    "Was happier a year ago. Recent changes have been concerning.",
    "Feeling less engaged lately. Need more clarity on future direction."
  ],
  "managerIssue": [
    "Manager doesn't provide clear direction or feedback.",
    "Lack of support from immediate supervisor.",
    "Manager plays favorites. Promotion decisions feel unfair.",
    "Need more regular 1:1s and career development conversations.",
    "Manager is overwhelmed and doesn't have time for the team.",
    "Communication with manager could be much better."
  ]
}
