{
  "strengths": {
    "exceptional": [
      "Consistently delivers exceptional results that exceed expectations. Technical expertise is among the highest on the team.",
      "A go-to person for complex problems. Demonstrates excellent judgment and consistently delivers high-quality work.",
      "Shows strong leadership potential and actively mentors junior team members. Drives initiatives forward independently.",
      "Exceptional communicator who bridges technical and business needs effectively. Highly respected by stakeholders.",
      "Outstanding ability to navigate ambiguity and deliver results. Sets the standard for the team.",
      "Demonstrates exceptional ownership and accountability. Projects consistently succeed under their leadership."
    ],
    "exceeds": [
      "Reliably exceeds expectations and takes on stretch assignments. Shows initiative in identifying improvements.",
      "Strong collaborator who elevates the work of those around them. Technical skills are well above average.",
      "Demonstrates excellent problem-solving skills. Proactively addresses issues before they become blockers.",
      "Effective communicator with stakeholders at all levels. Takes ownership of outcomes.",
      "Shows consistent growth and eagerness to take on new challenges. Reliable performer."
    ],
    "meets": [
      "Meets expectations consistently. Good team collaborator who contributes steadily.",
      "Reliable performer with solid technical foundation. Completes assignments on time.",
      "Communicates effectively with immediate team. Follows established processes well.",
      "Demonstrates good attention to detail and quality. Steady contributor to team goals.",
      "Works well within team structure. Receptive to feedback and implements suggestions."
    ],
    "developing": [
      "Shows potential but needs more focus on delivery timelines. Technical skills are developing.",
      "Learning the role and showing improvement. Needs more guidance on prioritization.",
      "Has good ideas but struggles with execution at times. Working on consistency.",
      "Technical skills need development. Would benefit from additional training and mentorship."
    ],
    "unsatisfactory": [
      "Performance has been below expectations. Requires significant support to complete basic tasks.",
      "Struggling to meet minimum requirements of the role. Improvement plan in place."
    ]
  },
  "areasForImprovement": {
    "exceptional": [
      "Could benefit from sharing knowledge more broadly across the organization.",
      "Should consider taking on more visible leadership opportunities.",
      "Would benefit from developing skills in adjacent areas to broaden impact."
    ],
    "exceeds": [
      "Could improve documentation of work for knowledge transfer.",
      "Should focus on delegating more effectively as responsibilities grow.",
      "Would benefit from more strategic thinking about long-term implications.",
      "Could improve time management when juggling multiple priorities."
    ],
    "meets": [
      "Should take more initiative in identifying process improvements.",
      "Could improve communication when facing blockers or delays.",
      "Would benefit from developing deeper technical expertise in key areas.",
      "Should work on providing more proactive updates to stakeholders.",
      "Could take more ownership of end-to-end outcomes."
    ],
    "developing": [
      "Needs to improve time management and meeting deadlines consistently.",
      "Should focus on asking for help earlier when blocked.",
      "Must improve attention to detail and reduce errors.",
      "Needs to develop stronger foundational skills in core areas.",
      "Should work on communicating progress and blockers more proactively."
    ],
    "unsatisfactory": [
      "Must demonstrate consistent improvement in basic job functions.",
      "Needs to significantly improve reliability and accountability.",
      "Requires immediate focus on meeting minimum role requirements."
    ]
  },
  "accomplishments": {
    "engineering": [
      "Successfully shipped {feature} on schedule",
      "Led migration of {system} with zero downtime",
      "Reduced build time by {percent}% through optimization",
      "Mentored {count} junior engineers throughout the year",
      "Implemented automated testing that improved coverage by {percent}%",
      "Resolved critical production issues within SLA",
      "Led technical design for {project}",
      "Contributed to open source tools used by the team"
    ],
    "sales": [
      "Exceeded quota by {percent}%",
      "Closed {count} new enterprise accounts",
      "Maintained {percent}% customer retention rate",
      "Generated ${amount}K in new pipeline",
      "Developed strategic relationships with key accounts",
      "Led successful product demos to C-level executives",
      "Trained {count} new team members on sales process"
    ],
    "marketing": [
      "Launched {count} successful campaigns",
      "Increased brand awareness by {percent}%",
      "Generated {count} qualified leads",
      "Managed marketing budget effectively, under budget by {percent}%",
      "Successfully executed product launch",
      "Improved email engagement rates by {percent}%",
      "Developed new content strategy that increased traffic"
    ],
    "operations": [
      "Improved process efficiency by {percent}%",
      "Reduced operational costs by ${amount}K",
      "Successfully managed {count} vendor relationships",
      "Implemented new workflow that saved {hours} hours weekly",
      "Maintained {percent}% on-time delivery rate",
      "Led successful office expansion project"
    ],
    "hr": [
      "Successfully onboarded {count} new employees",
      "Reduced time-to-fill by {percent}%",
      "Improved employee satisfaction scores by {points} points",
      "Launched new benefits program",
      "Led successful performance review cycle",
      "Implemented new HRIS features"
    ],
    "finance": [
      "Completed audit with zero findings",
      "Reduced close time by {days} days",
      "Implemented new financial controls",
      "Improved forecast accuracy by {percent}%",
      "Successfully managed budget of ${amount}M",
      "Automated {count} manual processes"
    ],
    "customer_success": [
      "Maintained {percent}% customer satisfaction score",
      "Reduced churn by {percent}%",
      "Successfully onboarded {count} new customers",
      "Resolved {count} escalations",
      "Improved NPS by {points} points",
      "Developed new customer training materials"
    ],
    "generic": [
      "Consistently met or exceeded performance targets",
      "Contributed positively to team culture",
      "Completed all required training on time",
      "Participated actively in team meetings and planning"
    ]
  },
  "managerComments": {
    "exceptional": [
      "{name} is a top performer who consistently raises the bar for the entire team. I highly recommend them for advancement opportunities.",
      "One of our strongest contributors. {name} demonstrates the leadership and technical skills needed for growth.",
      "{name} has exceeded expectations throughout this review period. They are ready for increased responsibility.",
      "Outstanding performance from {name}. Their contributions have significantly impacted our team's success."
    ],
    "exceeds": [
      "{name} continues to grow and deliver strong results. Looking forward to their continued development.",
      "Solid performance from {name}. They have shown great improvement and are on track for advancement.",
      "{name} is a valued team member who consistently delivers quality work. Encourage continued growth.",
      "Pleased with {name}'s performance this period. They are becoming a reliable senior contributor."
    ],
    "meets": [
      "{name} meets expectations and is a steady contributor to the team. Encourage taking on stretch goals.",
      "Consistent performance from {name}. Looking to see more initiative in the next period.",
      "{name} is reliable and meets requirements. Would like to see more proactive engagement.",
      "Satisfactory performance overall. {name} should focus on developing expertise in key areas."
    ],
    "developing": [
      "{name} is still developing in this role. We have created a development plan to support their growth.",
      "Performance needs improvement. {name} and I are working together on specific action items.",
      "{name} shows potential but needs to demonstrate more consistent delivery. Monitoring closely.",
      "Working with {name} on a structured improvement plan. Expect to see progress next period."
    ],
    "unsatisfactory": [
      "Performance improvement plan is in place. {name} must show significant improvement to remain in role.",
      "Serious concerns about performance. {name} requires immediate and sustained improvement."
    ]
  }
}
